#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terragrunt
time=2023-07-03T07:44:08Z level=info msg=The stack at /home/runner/work/terragrunt-delos/terragrunt-delos/dev/us-east-1/services/demo will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/terragrunt-delos/terragrunt-delos/dev/us-east-1/services/demo


time=2023-07-03T07:44:08Z level=warning msg=No double-slash (//) found in source URL /home/runner/work/terragrunt-delos/terragrunt-delos/dev/us-east-1/services/demo. Relative paths in downloaded Terraform code may not work. prefix=[/home/runner/work/terragrunt-delos/terragrunt-delos/dev/us-east-1/services/demo] 
[command]/home/runner/work/_temp/79040049-914b-4b73-8fbd-47d1193d80cb/terraform-bin plan -input=false -no-color
data.aws_vpc.current: Reading...
module.rds_cluster.data.aws_partition.current: Reading...
data.aws_acm_certificate.cert: Reading...
data.aws_cloudfront_cache_policy.Managed-CachingOptimized: Reading...
module.ecs.module.cluster.data.aws_partition.current: Reading...
module.rds_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_cloudfront_cache_policy.Managed-CachingOptimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_acm_certificate.cert: Read complete after 1s [id=arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769]
data.aws_vpc.current: Read complete after 1s [id=vpc-09b0352208f7664c6]
data.aws_subnets.database: Reading...
data.aws_security_group.rds_sg: Reading...
data.aws_subnets.public: Reading...
data.aws_security_group.alb_sg: Reading...
data.aws_security_group.ecs_sg: Reading...
data.aws_subnets.private: Reading...
data.aws_subnets.database: Read complete after 0s [id=us-east-1]
data.aws_security_group.rds_sg: Read complete after 0s [id=sg-094cf9949f5ed0c8e]
data.aws_subnets.private: Read complete after 0s [id=us-east-1]
data.aws_security_group.alb_sg: Read complete after 0s [id=sg-0236878e5c3f49881]
data.aws_subnets.public: Read complete after 0s [id=us-east-1]
data.aws_security_group.ecs_sg: Read complete after 0s [id=sg-03dbef70a525e09e6]
module.ecs.module.service["ecsdemo-frontend"].data.aws_region.current: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_caller_identity.current: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_partition.current: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.module.service["ecsdemo-frontend"].data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].data.aws_region.current: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
module.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.module.service["ecsdemo-frontend"].data.aws_caller_identity.current: Read complete after 0s [id=939406525635]
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3676596425]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudfront_origin_access_identity.default will be created
  + resource "aws_cloudfront_origin_access_identity" "default" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Delos website access."
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "rds-demo1-dev"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0771fc4b04d5dce70",
          + "subnet-0dceeadb273046169",
          + "subnet-0fb8a9094234267c0",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "rds-demo1-dev"
        }
      + tags_all                = {
          + "Name" = "rds-demo1-dev"
        }
      + vpc_id                  = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = true
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "demo1-dev"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-027ade9f8ead364b4",
          + "subnet-05cedc1b930b48f2d",
          + "subnet-09fb4a4f78b4ba2a0",
        ]
      + tags                                        = {
          + "Name" = "demo1-dev"
        }
      + tags_all                                    = {
          + "Name" = "demo1-dev"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.alb.aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "demo1-dev-demo1"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "demo1-dev-demo1"
        }
      + tags_all                           = {
          + "Name" = "demo1-dev-demo1"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-09b0352208f7664c6"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo1-dev-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo1-dev"
        }
      + tags_all               = {
          + "Name" = "demo1-dev"
        }
      + vpc_id                 = "vpc-09b0352208f7664c6"
    }

  # module.cdn.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "mgtinsurance.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "demo1-dev"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 403
          + response_page_path = "/errors/403.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 404
          + response_page_path = "/errors/404.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "ALB-compiler-explorer"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + path_pattern           = "/index.html"
          + target_origin_id       = "ALB-compiler-explorer"
          + viewer_protocol_policy = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "ALB-compiler-explorer"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.rds_cluster.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage                   = (known after apply)
      + allow_major_version_upgrade         = false
      + apply_immediately                   = (known after apply)
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 1
      + cluster_identifier                  = "demo1-dev"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = "delos"
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "rds-demo1-dev"
      + deletion_protection                 = false
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "14.5"
      + engine_version_actual               = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = true
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + manage_master_user_password         = true
      + master_user_secret                  = (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      + master_username                     = "delos"
      + network_type                        = (known after apply)
      + port                                = 5432
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + storage_type                        = (known after apply)
      + tags_all                            = (known after apply)
      + vpc_security_group_ids              = [
          + "sg-094cf9949f5ed0c8e",
        ]

      + timeouts {}
    }

  # module.rds_cluster.aws_rds_cluster_instance.this["0"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "rds-demo1-dev"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "14.5"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "demo1-dev-0"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r6g.2xlarge"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.rds_cluster.aws_rds_cluster_instance.this["1"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "rds-demo1-dev"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "14.5"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "demo1-dev-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r6g.2xlarge"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.ecs.module.cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/demo1-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs.module.cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "demo1-dev"
      + tags_all           = (known after apply)

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "demo1-dev"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "ecsdemo-frontend"
      + task_role_arn        = (known after apply)
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ecsdemo-frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "demo1"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-03dbef70a525e09e6",
            ]
          + subnets          = [
              + "subnet-001d2135bf2a1a5a4",
              + "subnet-027576b8c4e907954",
              + "subnet-0daa1ac6c3439cf3a",
            ]
        }

      + timeouts {}
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 512
                  + essential              = true
                  + image                  = "public.ecr.aws/aws-containers/ecsdemo-frontend:776fd50"
                  + interactive            = false
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/ecsdemo-frontend/demo1"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory                 = 1024
                  + memoryReservation      = 100
                  + name                   = "demo1"
                  + portMappings           = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + name          = "demo1"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = false
                  + startTimeout           = 30
                  + stopTimeout            = 120
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "ecsdemo-frontend"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn         = (known after apply)
      + description = "Task execution role IAM policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ecsdemo-frontend-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = "GetSSMParams"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for ecsdemo-frontend"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ecsdemo-frontend-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:us-east-1:939406525635:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "939406525635"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ecsdemo-frontend-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/ecsdemo-frontend/demo1"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 3, in provider "aws":
   3:   version = "4.67.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_vpc.current: Reading...%0Amodule.rds_cluster.data.aws_partition.current: Reading...%0Adata.aws_acm_certificate.cert: Reading...%0Adata.aws_cloudfront_cache_policy.Managed-CachingOptimized: Reading...%0Amodule.ecs.module.cluster.data.aws_partition.current: Reading...%0Amodule.rds_cluster.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecs.module.cluster.data.aws_partition.current: Read complete after 0s [id=aws]%0Adata.aws_cloudfront_cache_policy.Managed-CachingOptimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]%0Adata.aws_acm_certificate.cert: Read complete after 1s [id=arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769]%0Adata.aws_vpc.current: Read complete after 1s [id=vpc-09b0352208f7664c6]%0Adata.aws_subnets.database: Reading...%0Adata.aws_security_group.rds_sg: Reading...%0Adata.aws_subnets.public: Reading...%0Adata.aws_security_group.alb_sg: Reading...%0Adata.aws_security_group.ecs_sg: Reading...%0Adata.aws_subnets.private: Reading...%0Adata.aws_subnets.database: Read complete after 0s [id=us-east-1]%0Adata.aws_security_group.rds_sg: Read complete after 0s [id=sg-094cf9949f5ed0c8e]%0Adata.aws_subnets.private: Read complete after 0s [id=us-east-1]%0Adata.aws_security_group.alb_sg: Read complete after 0s [id=sg-0236878e5c3f49881]%0Adata.aws_subnets.public: Read complete after 0s [id=us-east-1]%0Adata.aws_security_group.ecs_sg: Read complete after 0s [id=sg-03dbef70a525e09e6]%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_region.current: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_caller_identity.current: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_partition.current: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec_assume[0]: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec[0]: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]%0Amodule.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].data.aws_region.current: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]%0Amodule.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].data.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_caller_identity.current: Read complete after 0s [id=939406525635]%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.tasks_assume[0]: Reading...%0Amodule.ecs.module.service["ecsdemo-frontend"].data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3676596425]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudfront_origin_access_identity.default will be created%0A  + resource "aws_cloudfront_origin_access_identity" "default" {%0A      + caller_reference                = (known after apply)%0A      + cloudfront_access_identity_path = (known after apply)%0A      + comment                         = "Delos website access."%0A      + etag                            = (known after apply)%0A      + iam_arn                         = (known after apply)%0A      + id                              = (known after apply)%0A      + s3_canonical_user_id            = (known after apply)%0A    }%0A%0A  # aws_db_subnet_group.default will be created%0A  + resource "aws_db_subnet_group" "default" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = "rds-demo1-dev"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = [%0A          + "subnet-0771fc4b04d5dce70",%0A          + "subnet-0dceeadb273046169",%0A          + "subnet-0fb8a9094234267c0",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags                    = {%0A          + "Name" = "rds-demo1-dev"%0A        }%0A      + tags_all                = {%0A          + "Name" = "rds-demo1-dev"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                         = (known after apply)%0A      + arn_suffix                                  = (known after apply)%0A      + desync_mitigation_mode                      = "defensive"%0A      + dns_name                                    = (known after apply)%0A      + drop_invalid_header_fields                  = false%0A      + enable_deletion_protection                  = false%0A      + enable_http2                                = true%0A      + enable_tls_version_and_cipher_suite_headers = false%0A      + enable_waf_fail_open                        = false%0A      + enable_xff_client_port                      = true%0A      + id                                          = (known after apply)%0A      + idle_timeout                                = 60%0A      + internal                                    = false%0A      + ip_address_type                             = "ipv4"%0A      + load_balancer_type                          = "application"%0A      + name                                        = "demo1-dev"%0A      + preserve_host_header                        = false%0A      + security_groups                             = (known after apply)%0A      + subnets                                     = [%0A          + "subnet-027ade9f8ead364b4",%0A          + "subnet-05cedc1b930b48f2d",%0A          + "subnet-09fb4a4f78b4ba2a0",%0A        ]%0A      + tags                                        = {%0A          + "Name" = "demo1-dev"%0A        }%0A      + tags_all                                    = {%0A          + "Name" = "demo1-dev"%0A        }%0A      + vpc_id                                      = (known after apply)%0A      + xff_header_processing_mode                  = "append"%0A      + zone_id                                     = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "10m"%0A          + update = "10m"%0A        }%0A    }%0A%0A  # module.alb.aws_lb_listener.frontend_https[0] will be created%0A  + resource "aws_lb_listener" "frontend_https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = "arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769"%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # module.alb.aws_lb_target_group.main[0] will be created%0A  + resource "aws_lb_target_group" "main" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "demo1-dev-demo1"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name" = "demo1-dev-demo1"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "demo1-dev-demo1"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-09b0352208f7664c6"%0A%0A      + health_check {%0A          + enabled             = (known after apply)%0A          + healthy_threshold   = (known after apply)%0A          + interval            = (known after apply)%0A          + matcher             = (known after apply)%0A          + path                = (known after apply)%0A          + port                = (known after apply)%0A          + protocol            = (known after apply)%0A          + timeout             = (known after apply)%0A          + unhealthy_threshold = (known after apply)%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A    }%0A%0A  # module.alb.aws_security_group.this[0] will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "demo1-dev-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "demo1-dev"%0A        }%0A      + tags_all               = {%0A          + "Name" = "demo1-dev"%0A        }%0A      + vpc_id                 = "vpc-09b0352208f7664c6"%0A    }%0A%0A  # module.cdn.aws_cloudfront_distribution.this[0] will be created%0A  + resource "aws_cloudfront_distribution" "this" {%0A      + aliases                        = [%0A          + "mgtinsurance.com",%0A        ]%0A      + arn                            = (known after apply)%0A      + caller_reference               = (known after apply)%0A      + comment                        = "demo1-dev"%0A      + default_root_object            = "index.html"%0A      + domain_name                    = (known after apply)%0A      + enabled                        = true%0A      + etag                           = (known after apply)%0A      + hosted_zone_id                 = (known after apply)%0A      + http_version                   = "http2"%0A      + id                             = (known after apply)%0A      + in_progress_validation_batches = (known after apply)%0A      + is_ipv6_enabled                = false%0A      + last_modified_time             = (known after apply)%0A      + price_class                    = "PriceClass_100"%0A      + retain_on_delete               = false%0A      + status                         = (known after apply)%0A      + tags_all                       = (known after apply)%0A      + trusted_key_groups             = (known after apply)%0A      + trusted_signers                = (known after apply)%0A      + wait_for_deployment            = true%0A%0A      + custom_error_response {%0A          + error_code         = 403%0A          + response_code      = 403%0A          + response_page_path = "/errors/403.html"%0A        }%0A      + custom_error_response {%0A          + error_code         = 404%0A          + response_code      = 404%0A          + response_page_path = "/errors/404.html"%0A        }%0A%0A      + default_cache_behavior {%0A          + allowed_methods        = [%0A              + "GET",%0A              + "HEAD",%0A              + "OPTIONS",%0A            ]%0A          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = true%0A          + default_ttl            = (known after apply)%0A          + max_ttl                = (known after apply)%0A          + min_ttl                = 0%0A          + target_origin_id       = "ALB-compiler-explorer"%0A          + trusted_key_groups     = (known after apply)%0A          + trusted_signers        = (known after apply)%0A          + viewer_protocol_policy = "redirect-to-https"%0A        }%0A%0A      + ordered_cache_behavior {%0A          + allowed_methods        = [%0A              + "GET",%0A              + "HEAD",%0A              + "OPTIONS",%0A            ]%0A          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = true%0A          + default_ttl            = (known after apply)%0A          + max_ttl                = (known after apply)%0A          + min_ttl                = 0%0A          + path_pattern           = "/index.html"%0A          + target_origin_id       = "ALB-compiler-explorer"%0A          + viewer_protocol_policy = "redirect-to-https"%0A        }%0A%0A      + origin {%0A          + connection_attempts = 3%0A          + connection_timeout  = 10%0A          + domain_name         = (known after apply)%0A          + origin_id           = "ALB-compiler-explorer"%0A%0A          + custom_origin_config {%0A              + http_port                = 80%0A              + https_port               = 443%0A              + origin_keepalive_timeout = 5%0A              + origin_protocol_policy   = "match-viewer"%0A              + origin_read_timeout      = 30%0A              + origin_ssl_protocols     = [%0A                  + "TLSv1",%0A                  + "TLSv1.1",%0A                  + "TLSv1.2",%0A                ]%0A            }%0A        }%0A%0A      + restrictions {%0A          + geo_restriction {%0A              + locations        = (known after apply)%0A              + restriction_type = "none"%0A            }%0A        }%0A%0A      + viewer_certificate {%0A          + acm_certificate_arn      = "arn:aws:acm:us-east-1:939406525635:certificate/0423de33-abcf-4e75-8258-fa80f7665769"%0A          + minimum_protocol_version = "TLSv1"%0A          + ssl_support_method       = "sni-only"%0A        }%0A    }%0A%0A  # module.rds_cluster.aws_rds_cluster.this[0] will be created%0A  + resource "aws_rds_cluster" "this" {%0A      + allocated_storage                   = (known after apply)%0A      + allow_major_version_upgrade         = false%0A      + apply_immediately                   = (known after apply)%0A      + arn                                 = (known after apply)%0A      + availability_zones                  = (known after apply)%0A      + backtrack_window                    = 0%0A      + backup_retention_period             = 1%0A      + cluster_identifier                  = "demo1-dev"%0A      + cluster_identifier_prefix           = (known after apply)%0A      + cluster_members                     = (known after apply)%0A      + cluster_resource_id                 = (known after apply)%0A      + copy_tags_to_snapshot               = false%0A      + database_name                       = "delos"%0A      + db_cluster_parameter_group_name     = (known after apply)%0A      + db_subnet_group_name                = "rds-demo1-dev"%0A      + deletion_protection                 = false%0A      + enable_global_write_forwarding      = false%0A      + enable_http_endpoint                = false%0A      + endpoint                            = (known after apply)%0A      + engine                              = "aurora-postgresql"%0A      + engine_mode                         = "provisioned"%0A      + engine_version                      = "14.5"%0A      + engine_version_actual               = (known after apply)%0A      + hosted_zone_id                      = (known after apply)%0A      + iam_database_authentication_enabled = true%0A      + iam_roles                           = (known after apply)%0A      + id                                  = (known after apply)%0A      + kms_key_id                          = (known after apply)%0A      + manage_master_user_password         = true%0A      + master_user_secret                  = (known after apply)%0A      + master_user_secret_kms_key_id       = (known after apply)%0A      + master_username                     = "delos"%0A      + network_type                        = (known after apply)%0A      + port                                = 5432%0A      + preferred_backup_window             = "02:00-03:00"%0A      + preferred_maintenance_window        = "sun:05:00-sun:06:00"%0A      + reader_endpoint                     = (known after apply)%0A      + skip_final_snapshot                 = true%0A      + storage_encrypted                   = true%0A      + storage_type                        = (known after apply)%0A      + tags_all                            = (known after apply)%0A      + vpc_security_group_ids              = [%0A          + "sg-094cf9949f5ed0c8e",%0A        ]%0A%0A      + timeouts {}%0A    }%0A%0A  # module.rds_cluster.aws_rds_cluster_instance.this["0"] will be created%0A  + resource "aws_rds_cluster_instance" "this" {%0A      + apply_immediately                     = (known after apply)%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + cluster_identifier                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_parameter_group_name               = (known after apply)%0A      + db_subnet_group_name                  = "rds-demo1-dev"%0A      + dbi_resource_id                       = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "aurora-postgresql"%0A      + engine_version                        = "14.5"%0A      + engine_version_actual                 = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "demo1-dev-0"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.r6g.2xlarge"%0A      + kms_key_id                            = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + network_type                          = (known after apply)%0A      + performance_insights_enabled          = (known after apply)%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + preferred_backup_window               = (known after apply)%0A      + preferred_maintenance_window          = "sun:05:00-sun:06:00"%0A      + promotion_tier                        = 0%0A      + publicly_accessible                   = false%0A      + storage_encrypted                     = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + writer                                = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.rds_cluster.aws_rds_cluster_instance.this["1"] will be created%0A  + resource "aws_rds_cluster_instance" "this" {%0A      + apply_immediately                     = (known after apply)%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + cluster_identifier                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_parameter_group_name               = (known after apply)%0A      + db_subnet_group_name                  = "rds-demo1-dev"%0A      + dbi_resource_id                       = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "aurora-postgresql"%0A      + engine_version                        = "14.5"%0A      + engine_version_actual                 = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "demo1-dev-1"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.r6g.2xlarge"%0A      + kms_key_id                            = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + network_type                          = (known after apply)%0A      + performance_insights_enabled          = (known after apply)%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + preferred_backup_window               = (known after apply)%0A      + preferred_maintenance_window          = "sun:05:00-sun:06:00"%0A      + promotion_tier                        = 0%0A      + publicly_accessible                   = false%0A      + storage_encrypted                     = (known after apply)%0A      + tags_all                              = (known after apply)%0A      + writer                                = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.ecs.module.cluster.aws_cloudwatch_log_group.this[0] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/aws/ecs/demo1-dev"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 90%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0A  # module.ecs.module.cluster.aws_ecs_cluster.this[0] will be created%0A  + resource "aws_ecs_cluster" "this" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "demo1-dev"%0A      + tags_all           = (known after apply)%0A%0A      + configuration {%0A          + execute_command_configuration {%0A              + logging = "DEFAULT"%0A            }%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # module.ecs.module.cluster.aws_ecs_cluster_capacity_providers.this[0] will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "this" {%0A      + capacity_providers = [%0A          + "FARGATE",%0A          + "FARGATE_SPOT",%0A        ]%0A      + cluster_name       = "demo1-dev"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 50%0A        }%0A      + default_capacity_provider_strategy {%0A          + base              = 20%0A          + capacity_provider = "FARGATE"%0A          + weight            = 50%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].data.aws_ecs_task_definition.this[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ecs_task_definition" "this" {%0A      + arn                  = (known after apply)%0A      + arn_without_revision = (known after apply)%0A      + execution_role_arn   = (known after apply)%0A      + family               = (known after apply)%0A      + id                   = (known after apply)%0A      + network_mode         = (known after apply)%0A      + revision             = (known after apply)%0A      + status               = (known after apply)%0A      + task_definition      = "ecsdemo-frontend"%0A      + task_role_arn        = (known after apply)%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_policy.this["cpu"] will be created%0A  + resource "aws_appautoscaling_policy" "this" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "cpu"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in   = false%0A          + scale_in_cooldown  = 300%0A          + scale_out_cooldown = 60%0A          + target_value       = 75%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_policy.this["memory"] will be created%0A  + resource "aws_appautoscaling_policy" "this" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "memory"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in   = false%0A          + scale_in_cooldown  = 300%0A          + scale_out_cooldown = 60%0A          + target_value       = 75%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_appautoscaling_target.this[0] will be created%0A  + resource "aws_appautoscaling_target" "this" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + max_capacity       = 10%0A      + min_capacity       = 1%0A      + resource_id        = (known after apply)%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A      + tags_all           = (known after apply)%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_ecs_service.this[0] will be created%0A  + resource "aws_ecs_service" "this" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 66%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = true%0A      + enable_execute_command             = false%0A      + force_new_deployment               = true%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "ecsdemo-frontend"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "demo1"%0A          + container_port   = 80%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-03dbef70a525e09e6",%0A            ]%0A          + subnets          = [%0A              + "subnet-001d2135bf2a1a5a4",%0A              + "subnet-027576b8c4e907954",%0A              + "subnet-0daa1ac6c3439cf3a",%0A            ]%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_ecs_task_definition.this[0] will be created%0A  + resource "aws_ecs_task_definition" "this" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + cpu                    = 512%0A                  + essential              = true%0A                  + image                  = "public.ecr.aws/aws-containers/ecsdemo-frontend:776fd50"%0A                  + interactive            = false%0A                  + logConfiguration       = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-group         = "/aws/ecs/ecsdemo-frontend/demo1"%0A                          + awslogs-region        = "us-east-1"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + memory                 = 1024%0A                  + memoryReservation      = 100%0A                  + name                   = "demo1"%0A                  + portMappings           = [%0A                      + {%0A                          + containerPort = 80%0A                          + hostPort      = 80%0A                          + name          = "demo1"%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                  + privileged             = false%0A                  + pseudoTerminal         = false%0A                  + readonlyRootFilesystem = false%0A                  + startTimeout           = 30%0A                  + stopTimeout            = 120%0A                },%0A            ]%0A        )%0A      + cpu                      = "1024"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "ecsdemo-frontend"%0A      + id                       = (known after apply)%0A      + memory                   = "4096"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = (known after apply)%0A      + task_role_arn            = (known after apply)%0A%0A      + runtime_platform {%0A          + cpu_architecture        = "X86_64"%0A          + operating_system_family = "LINUX"%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_policy.task_exec[0] will be created%0A  + resource "aws_iam_policy" "task_exec" {%0A      + arn         = (known after apply)%0A      + description = "Task execution role IAM policy"%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ecsdemo-frontend-"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:PutLogEvents",%0A                          + "logs:CreateLogStream",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "Logs"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "ECR"%0A                    },%0A                  + {%0A                      + Action   = "ssm:GetParameters"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:ssm:*:*:parameter/*"%0A                      + Sid      = "GetSSMParams"%0A                    },%0A                  + {%0A                      + Action   = "secretsmanager:GetSecretValue"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"%0A                      + Sid      = "GetSecrets"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role.task_exec[0] will be created%0A  + resource "aws_iam_role" "task_exec" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "ECSTaskExecutionAssumeRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Task execution role for ecsdemo-frontend"%0A      + force_detach_policies = true%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = (known after apply)%0A      + name_prefix           = "ecsdemo-frontend-"%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role.tasks[0] will be created%0A  + resource "aws_iam_role" "tasks" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Condition = {%0A                          + ArnLike      = {%0A                              + "aws:SourceArn" = "arn:aws:ecs:us-east-1:939406525635:*"%0A                            }%0A                          + StringEquals = {%0A                              + "aws:SourceAccount" = "939406525635"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                      + Sid       = "ECSTasksAssumeRole"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = true%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = (known after apply)%0A      + name_prefix           = "ecsdemo-frontend-"%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy {%0A          + name   = (known after apply)%0A          + policy = (known after apply)%0A        }%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].aws_iam_role_policy_attachment.task_exec[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "task_exec" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.ecs.module.service["ecsdemo-frontend"].module.container_definition["demo1"].aws_cloudwatch_log_group.this[0] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "/aws/ecs/ecsdemo-frontend/demo1"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 14%0A      + skip_destroy      = false%0A      + tags_all          = (known after apply)%0A    }%0A%0APlan: 23 to add, 0 to change, 0 to destroy.%0A%0AWarning: Version constraints inside provider configuration blocks are deprecated%0A%0A  on provider.tf line 3, in provider "aws":%0A   3:   version = "4.67.0"%0A%0ATerraform 0.13 and earlier allowed provider version constraints inside the%0Aprovider configuration block, but that is now deprecated and will be removed%0Ain a future version of Terraform. To silence this warning, move the provider%0Aversion constraint into the required_providers block.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
time=2023-07-03T07:44:25Z level=info msg=[command]/home/runner/work/_temp/79040049-914b-4b73-8fbd-47d1193d80cb/terraform-bin init
[0m[1mInitializing modules...[0m
Downloading registry.terraform.io/terraform-aws-modules/alb/aws 8.7.0 for alb...
- alb in .terraform/modules/alb
Downloading registry.terraform.io/terraform-aws-modules/cloudfront/aws 3.2.1 for cdn...
- cdn in .terraform/modules/cdn
Downloading registry.terraform.io/terraform-aws-modules/ecs/aws 5.2.0 for ecs...
- ecs in .terraform/modules/ecs
- ecs.cluster in .terraform/modules/ecs/modules/cluster
- ecs.service in .terraform/modules/ecs/modules/service
- ecs.service.container_definition in .terraform/modules/ecs/modules/container-definition
Downloading registry.terraform.io/terraform-aws-modules/rds-aurora/aws 8.3.1 for rds_cluster...
- rds_cluster in .terraform/modules/rds_cluster

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching ">= 4.29.0, >= 4.55.0, >= 4.59.0, >= 4.67.0, 4.67.0"...
- Installing hashicorp/aws v4.67.0...
- Installed hashicorp/aws v4.67.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[33m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on provider.tf line 3, in provider "aws":
[33m│[0m [0m   3:   version = [4m"4.67.0"[0m[0m
[33m│[0m [0m
[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the
[33m│[0m [0mprovider configuration block, but that is now deprecated and will be
[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the
[33m│[0m [0mprovider version constraint into the required_providers block.
[33m╵[0m[0m
[0m[0m
[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1mInitializing modules...[0m%0ADownloading registry.terraform.io/terraform-aws-modules/alb/aws 8.7.0 for alb...%0A- alb in .terraform/modules/alb%0ADownloading registry.terraform.io/terraform-aws-modules/cloudfront/aws 3.2.1 for cdn...%0A- cdn in .terraform/modules/cdn%0ADownloading registry.terraform.io/terraform-aws-modules/ecs/aws 5.2.0 for ecs...%0A- ecs in .terraform/modules/ecs%0A- ecs.cluster in .terraform/modules/ecs/modules/cluster%0A- ecs.service in .terraform/modules/ecs/modules/service%0A- ecs.service.container_definition in .terraform/modules/ecs/modules/container-definition%0ADownloading registry.terraform.io/terraform-aws-modules/rds-aurora/aws 8.3.1 for rds_cluster...%0A- rds_cluster in .terraform/modules/rds_cluster%0A%0A[0m[1mInitializing the backend...[0m%0A[0m[32m%0ASuccessfully configured the backend "s3"! Terraform will automatically%0Ause this backend unless the backend configuration changes.[0m%0A%0A[0m[1mInitializing provider plugins...[0m%0A- Finding hashicorp/aws versions matching ">= 4.29.0, >= 4.55.0, >= 4.59.0, >= 4.67.0, 4.67.0"...%0A- Installing hashicorp/aws v4.67.0...%0A- Installed hashicorp/aws v4.67.0 (signed by HashiCorp)%0A%0ATerraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider%0Aselections it made above. Include this file in your version control repository%0Aso that Terraform can guarantee to make the same selections by default when%0Ayou run "terraform init" in the future.[0m%0A%0A[33m[33m╷[0m[0m%0A[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m%0A[33m│[0m [0m%0A[33m│[0m [0m[0m  on provider.tf line 3, in provider "aws":%0A[33m│[0m [0m   3:   version = [4m"4.67.0"[0m[0m%0A[33m│[0m [0m%0A[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the%0A[33m│[0m [0mprovider configuration block, but that is now deprecated and will be%0A[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the%0A[33m│[0m [0mprovider version constraint into the required_providers block.%0A[33m╵[0m[0m%0A[0m[0m%0A[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m%0A[0m[32m%0AYou may now begin working with Terraform. Try running "terraform plan" to see%0Aany changes that are required for your infrastructure. All Terraform commands%0Ashould now work.%0A%0AIf you ever set or change modules or backend configuration for Terraform,%0Arerun this command to reinitialize your working directory. If you forget, other%0Acommands will detect it and remind you to do so if necessary.[0m%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pushed by: @danyel-s1, Commit: `8e6021ca2dbc1ebc848b32a43778580c224c9a05`, Action: `pull_request`*